{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v3.1.0", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "leaky_re_lu_9", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "instance_normalization_7", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_7", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_10", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "instance_normalization_8", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_8", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_11", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "instance_normalization_9", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_9", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_11", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_12", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "instance_normalization_10", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_10", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_12", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "instance_normalization_11", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_11", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "instance_normalization_12", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_12", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"name": "instance_normalization_13", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_13", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]]}, {"name": "up_sampling2d_4", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_4", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_4", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["conv2d_18", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_11/kernel", "shape": [4, 4, 3, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15695366158204918, "scale": 0.001089955983208675, "original_dtype": "float32"}}, {"name": "conv2d_11/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.022859688658340305, "scale": 0.00021980469863788754, "original_dtype": "float32"}}, {"name": "conv2d_12/kernel", "shape": [4, 4, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09186883305802064, "scale": 0.0007121614965738035, "original_dtype": "float32"}}, {"name": "conv2d_12/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.010051080606439534, "scale": 7.078225779182771e-05, "original_dtype": "float32"}}, {"name": "conv2d_13/kernel", "shape": [4, 4, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07210476082914016, "scale": 0.0006324979020100014, "original_dtype": "float32"}}, {"name": "conv2d_13/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.010284252223723075, "scale": 7.4523566838573e-05, "original_dtype": "float32"}}, {"name": "conv2d_14/kernel", "shape": [4, 4, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07790125102973451, "scale": 0.0006232100082378761, "original_dtype": "float32"}}, {"name": "conv2d_14/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.01285505287495314, "scale": 8.347436931787753e-05, "original_dtype": "float32"}}, {"name": "conv2d_15/kernel", "shape": [4, 4, 256, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09588852305622661, "scale": 0.0007671081844498129, "original_dtype": "float32"}}, {"name": "conv2d_15/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.014954568135241667, "scale": 0.00012566863979194677, "original_dtype": "float32"}}, {"name": "conv2d_16/kernel", "shape": [4, 4, 256, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08459682090609681, "scale": 0.0006822324266620711, "original_dtype": "float32"}}, {"name": "conv2d_16/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.007331973117064027, "scale": 7.969535996808725e-05, "original_dtype": "float32"}}, {"name": "conv2d_17/kernel", "shape": [4, 4, 128, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11224730797842436, "scale": 0.0008439647216422885, "original_dtype": "float32"}}, {"name": "conv2d_17/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0042000689635089804, "scale": 8.936316943636128e-05, "original_dtype": "float32"}}, {"name": "conv2d_18/kernel", "shape": [4, 4, 64, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.10235927514001435, "scale": 0.0007638751876120473, "original_dtype": "float32"}}, {"name": "conv2d_18/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0062021758197350245, "scale": 3.2135626008989766e-05, "original_dtype": "float32"}}, {"name": "instance_normalization_10/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.007440447807312, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_10/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.009940451011061668, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_11/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0820322036743164, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_11/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0032414088491350412, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_12/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.0259369611740112, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_12/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.007993225008249283, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_13/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8833016157150269, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_13/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.025374528020620346, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_7/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8260169625282288, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_7/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.011581456288695335, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_8/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9737429618835449, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_8/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.005433087237179279, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_9/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9147558212280273, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_9/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.006444065365940332, "scale": 1.0, "original_dtype": "float32"}}]}]}