{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v3.1.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "filters": 32, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "instance_normalization_7", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_7", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "instance_normalization_8", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_8", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "instance_normalization_9", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_9", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "instance_normalization_10", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_10", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "instance_normalization_11", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_11", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["instance_normalization_11", 0, 0, {}]]]}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"name": "instance_normalization_12", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_12", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_12", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"name": "instance_normalization_13", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_13", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}], ["instance_normalization_13", 0, 0, {}]]]}, {"name": "zero_padding2d_6", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"name": "instance_normalization_14", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_14", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]]}, {"name": "zero_padding2d_7", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"name": "instance_normalization_15", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_15", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["add_2", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]]}, {"name": "zero_padding2d_8", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"name": "instance_normalization_16", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_16", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]]}, {"name": "zero_padding2d_9", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"name": "instance_normalization_17", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_17", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["add_3", 0, 0, {}], ["instance_normalization_17", 0, 0, {}]]]}, {"name": "zero_padding2d_10", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"name": "instance_normalization_18", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_18", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_18", 0, 0, {}]]]}, {"name": "zero_padding2d_11", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"name": "instance_normalization_19", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_19", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["add_4", 0, 0, {}], ["instance_normalization_19", 0, 0, {}]]]}, {"name": "zero_padding2d_12", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"name": "instance_normalization_20", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_20", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_20", 0, 0, {}]]]}, {"name": "zero_padding2d_13", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"name": "instance_normalization_21", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_21", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["add_5", 0, 0, {}], ["instance_normalization_21", 0, 0, {}]]]}, {"name": "zero_padding2d_14", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_14", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"name": "instance_normalization_22", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_22", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_22", 0, 0, {}]]]}, {"name": "zero_padding2d_15", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"name": "instance_normalization_23", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_23", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["add_6", 0, 0, {}], ["instance_normalization_23", 0, 0, {}]]]}, {"name": "zero_padding2d_16", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_16", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"name": "instance_normalization_24", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_24", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_24", 0, 0, {}]]]}, {"name": "zero_padding2d_17", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"name": "instance_normalization_25", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_25", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["add_7", 0, 0, {}], ["instance_normalization_25", 0, 0, {}]]]}, {"name": "zero_padding2d_18", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_18", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]]}, {"name": "instance_normalization_26", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_26", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_26", 0, 0, {}]]]}, {"name": "zero_padding2d_19", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_19", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]]}, {"name": "instance_normalization_27", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_27", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_31", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["add_8", 0, 0, {}], ["instance_normalization_27", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "instance_normalization_28", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_28", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_28", 0, 0, {}]]]}, {"name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "instance_normalization_29", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_29", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_29", 0, 0, {}]]]}, {"name": "zero_padding2d_20", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_20", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "filters": 3, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["activation_15", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_11/kernel", "shape": [7, 7, 3, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19124663022218966, "scale": 0.0016630141758451275, "original_dtype": "float32"}}, {"name": "conv2d_11/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.024854894946603215, "scale": 0.000230137916172252, "original_dtype": "float32"}}, {"name": "conv2d_12/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20031481817656874, "scale": 0.0014621519574932024, "original_dtype": "float32"}}, {"name": "conv2d_12/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02854764264296083, "scale": 0.00022129955537178938, "original_dtype": "float32"}}, {"name": "conv2d_13/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1937682633890825, "scale": 0.0014569042360081392, "original_dtype": "float32"}}, {"name": "conv2d_13/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.010925748832889047, "scale": 6.24328504736517e-05, "original_dtype": "float32"}}, {"name": "conv2d_14/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18129249741049375, "scale": 0.0015495085248760148, "original_dtype": "float32"}}, {"name": "conv2d_14/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.001193067037007388, "scale": 1.1812544920865228e-05, "original_dtype": "float32"}}, {"name": "conv2d_15/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15776311439626356, "scale": 0.0013838869683882769, "original_dtype": "float32"}}, {"name": "conv2d_15/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0031215078946129947, "scale": 1.6964716818548883e-05, "original_dtype": "float32"}}, {"name": "conv2d_16/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2600659868296455, "scale": 0.00173377324553097, "original_dtype": "float32"}}, {"name": "conv2d_16/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0006889454358458227, "scale": 5.141383849595692e-06, "original_dtype": "float32"}}, {"name": "conv2d_17/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.180846606983858, "scale": 0.0014128641170613905, "original_dtype": "float32"}}, {"name": "conv2d_17/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0008648396999228234, "scale": 6.756560155647058e-06, "original_dtype": "float32"}}, {"name": "conv2d_18/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18526282029993396, "scale": 0.001543856835832783, "original_dtype": "float32"}}, {"name": "conv2d_18/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0003110524862730766, "scale": 2.6585682587442443e-06, "original_dtype": "float32"}}, {"name": "conv2d_19/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2067526976267497, "scale": 0.0015202404237261006, "original_dtype": "float32"}}, {"name": "conv2d_19/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0008167544288524226, "scale": 5.711569432534423e-06, "original_dtype": "float32"}}, {"name": "conv2d_20/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20756772896822762, "scale": 0.0015041139780306348, "original_dtype": "float32"}}, {"name": "conv2d_20/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00033712213603304884, "scale": 2.107013350206555e-06, "original_dtype": "float32"}}, {"name": "conv2d_21/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19351854674956376, "scale": 0.0014772408148821662, "original_dtype": "float32"}}, {"name": "conv2d_21/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.001191457430832088, "scale": 6.337539525702596e-06, "original_dtype": "float32"}}, {"name": "conv2d_22/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16961414217948914, "scale": 0.0016467392444610596, "original_dtype": "float32"}}, {"name": "conv2d_22/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00019963952660213645, "scale": 1.5356886661702805e-06, "original_dtype": "float32"}}, {"name": "conv2d_23/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2001026640920078, "scale": 0.0016268509275772993, "original_dtype": "float32"}}, {"name": "conv2d_23/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0012964262055260513, "scale": 6.85939791283625e-06, "original_dtype": "float32"}}, {"name": "conv2d_24/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.23592587428934433, "scale": 0.001747599068809958, "original_dtype": "float32"}}, {"name": "conv2d_24/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00015490444653265762, "scale": 1.114420478652213e-06, "original_dtype": "float32"}}, {"name": "conv2d_25/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22967054575097326, "scale": 0.001652306084539376, "original_dtype": "float32"}}, {"name": "conv2d_25/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0004796188841710853, "scale": 6.0711251160896875e-06, "original_dtype": "float32"}}, {"name": "conv2d_26/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21428108273767957, "scale": 0.0016483160210590737, "original_dtype": "float32"}}, {"name": "conv2d_26/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00013766189513262362, "scale": 1.1568226481733077e-06, "original_dtype": "float32"}}, {"name": "conv2d_27/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2457952505233241, "scale": 0.001834292914353165, "original_dtype": "float32"}}, {"name": "conv2d_27/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0005179749746971271, "scale": 3.5970484353967156e-06, "original_dtype": "float32"}}, {"name": "conv2d_28/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1957098350805395, "scale": 0.001565678680644316, "original_dtype": "float32"}}, {"name": "conv2d_28/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00016346944270052895, "scale": 1.02810970251905e-06, "original_dtype": "float32"}}, {"name": "conv2d_29/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.18429187074595807, "scale": 0.0014511170924878588, "original_dtype": "float32"}}, {"name": "conv2d_29/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0006271606744906189, "scale": 4.295621058154924e-06, "original_dtype": "float32"}}, {"name": "conv2d_30/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2269256872289321, "scale": 0.0017191339941585765, "original_dtype": "float32"}}, {"name": "conv2d_30/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00019012398472256667, "scale": 1.4624921901735897e-06, "original_dtype": "float32"}}, {"name": "conv2d_31/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1899011751015981, "scale": 0.0014171729485193889, "original_dtype": "float32"}}, {"name": "conv2d_31/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00038042566145532854, "scale": 2.717326153252347e-06, "original_dtype": "float32"}}, {"name": "conv2d_32/kernel", "shape": [7, 7, 32, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09499826589051416, "scale": 0.000703690858448253, "original_dtype": "float32"}}, {"name": "conv2d_32/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.018484447107595555, "scale": 0.00023698009112301993, "original_dtype": "float32"}}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1883662183495129, "scale": 0.001609967678200965, "original_dtype": "float32"}}, {"name": "conv2d_transpose_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.001539550127242418, "scale": 1.386982096614791e-05, "original_dtype": "float32"}}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.37658136720750846, "scale": 0.0023390147031522265, "original_dtype": "float32"}}, {"name": "conv2d_transpose_2/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.029847479684680118, "scale": 0.0002815799970252841, "original_dtype": "float32"}}]}]}