{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "filters": 32, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "instance_normalization_13", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_13", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_13", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "instance_normalization_14", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_14", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "instance_normalization_15", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_15", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_15", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "instance_normalization_16", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_16", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "instance_normalization_17", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_17", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["instance_normalization_17", 0, 0, {}]]]}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"name": "instance_normalization_18", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_18", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_18", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"name": "instance_normalization_19", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_19", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}], ["instance_normalization_19", 0, 0, {}]]]}, {"name": "zero_padding2d_6", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"name": "instance_normalization_20", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_20", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_20", 0, 0, {}]]]}, {"name": "zero_padding2d_7", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"name": "instance_normalization_21", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_21", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["add_2", 0, 0, {}], ["instance_normalization_21", 0, 0, {}]]]}, {"name": "zero_padding2d_8", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"name": "instance_normalization_22", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_22", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_22", 0, 0, {}]]]}, {"name": "zero_padding2d_9", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"name": "instance_normalization_23", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_23", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["add_3", 0, 0, {}], ["instance_normalization_23", 0, 0, {}]]]}, {"name": "zero_padding2d_10", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"name": "instance_normalization_24", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_24", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_24", 0, 0, {}]]]}, {"name": "zero_padding2d_11", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"name": "instance_normalization_25", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_25", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["add_4", 0, 0, {}], ["instance_normalization_25", 0, 0, {}]]]}, {"name": "zero_padding2d_12", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"name": "instance_normalization_26", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_26", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_26", 0, 0, {}]]]}, {"name": "zero_padding2d_13", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"name": "instance_normalization_27", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_27", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["add_5", 0, 0, {}], ["instance_normalization_27", 0, 0, {}]]]}, {"name": "zero_padding2d_14", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_14", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"name": "instance_normalization_28", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_28", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_28", 0, 0, {}]]]}, {"name": "zero_padding2d_15", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"name": "instance_normalization_29", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_29", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["add_6", 0, 0, {}], ["instance_normalization_29", 0, 0, {}]]]}, {"name": "zero_padding2d_16", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_16", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"name": "instance_normalization_30", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_30", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_30", 0, 0, {}]]]}, {"name": "zero_padding2d_17", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"name": "instance_normalization_31", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_31", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["add_7", 0, 0, {}], ["instance_normalization_31", 0, 0, {}]]]}, {"name": "zero_padding2d_18", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_18", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]]}, {"name": "instance_normalization_32", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_32", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_32", 0, 0, {}]]]}, {"name": "zero_padding2d_19", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_19", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]]}, {"name": "instance_normalization_33", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_33", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_31", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["add_8", 0, 0, {}], ["instance_normalization_33", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_1", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "instance_normalization_34", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_34", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_34", 0, 0, {}]]]}, {"name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "instance_normalization_35", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_35", "trainable": true, "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_35", 0, 0, {}]]]}, {"name": "zero_padding2d_20", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_20", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "filters": 3, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["activation_15", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_11/kernel", "shape": [7, 7, 3, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1626208034216189, "scale": 0.0013114580921098297, "original_dtype": "float32"}}, {"name": "conv2d_11/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11616166257390789, "scale": 0.0015284429286040512, "original_dtype": "float32"}}, {"name": "conv2d_12/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.33953238795785345, "scale": 0.002783052360310274, "original_dtype": "float32"}}, {"name": "conv2d_12/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06185194994596874, "scale": 0.0007109419534019395, "original_dtype": "float32"}}, {"name": "conv2d_13/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.269178322132896, "scale": 0.0023406810620251826, "original_dtype": "float32"}}, {"name": "conv2d_13/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07175411818658603, "scale": 0.0010106213829096625, "original_dtype": "float32"}}, {"name": "conv2d_14/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2922451236668755, "scale": 0.003142420684590059, "original_dtype": "float32"}}, {"name": "conv2d_14/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08153466135263443, "scale": 0.0010066007574399312, "original_dtype": "float32"}}, {"name": "conv2d_15/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.241910018640406, "scale": 0.0022821699871736416, "original_dtype": "float32"}}, {"name": "conv2d_15/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09892716548022101, "scale": 0.0008677821533352721, "original_dtype": "float32"}}, {"name": "conv2d_16/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2533243677195381, "scale": 0.0019191239978752885, "original_dtype": "float32"}}, {"name": "conv2d_16/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.056651738110710594, "scale": 0.0005901222719865687, "original_dtype": "float32"}}, {"name": "conv2d_17/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22489133255154478, "scale": 0.0019058587504368202, "original_dtype": "float32"}}, {"name": "conv2d_17/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13066699016912312, "scale": 0.0007731774566220302, "original_dtype": "float32"}}, {"name": "conv2d_18/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.26205851564220356, "scale": 0.002113375126146803, "original_dtype": "float32"}}, {"name": "conv2d_18/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06362164045373599, "scale": 0.00048566137750943503, "original_dtype": "float32"}}, {"name": "conv2d_19/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24584474078580446, "scale": 0.0019667579262864355, "original_dtype": "float32"}}, {"name": "conv2d_19/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.105988167664584, "scale": 0.0007850975382561777, "original_dtype": "float32"}}, {"name": "conv2d_20/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3217171470324198, "scale": 0.0021737645069758098, "original_dtype": "float32"}}, {"name": "conv2d_20/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11566085049919053, "scale": 0.0008631406753670935, "original_dtype": "float32"}}, {"name": "conv2d_21/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2518242679390253, "scale": 0.002189776242948046, "original_dtype": "float32"}}, {"name": "conv2d_21/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07083296074586756, "scale": 0.0005902746728822297, "original_dtype": "float32"}}, {"name": "conv2d_22/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2518185285960927, "scale": 0.0019985597507626404, "original_dtype": "float32"}}, {"name": "conv2d_22/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.16457437221326082, "scale": 0.0011045259880084618, "original_dtype": "float32"}}, {"name": "conv2d_23/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20721423310392043, "scale": 0.0018176687114378985, "original_dtype": "float32"}}, {"name": "conv2d_23/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09394634366035462, "scale": 0.0007117147246996562, "original_dtype": "float32"}}, {"name": "conv2d_24/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1912265911990521, "scale": 0.0016205643321953568, "original_dtype": "float32"}}, {"name": "conv2d_24/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0960081402577606, "scale": 0.0006907060450198604, "original_dtype": "float32"}}, {"name": "conv2d_25/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2999943857099496, "scale": 0.002608646832260431, "original_dtype": "float32"}}, {"name": "conv2d_25/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09341524427427965, "scale": 0.0007594735306852004, "original_dtype": "float32"}}, {"name": "conv2d_26/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2318146293069802, "scale": 0.0021074057209725474, "original_dtype": "float32"}}, {"name": "conv2d_26/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24595497934257282, "scale": 0.001322338598615983, "original_dtype": "float32"}}, {"name": "conv2d_27/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.27348597096461874, "scale": 0.00244183902646981, "original_dtype": "float32"}}, {"name": "conv2d_27/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0787200595818314, "scale": 0.0006786212032916499, "original_dtype": "float32"}}, {"name": "conv2d_28/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.26768350566134735, "scale": 0.002075065935359282, "original_dtype": "float32"}}, {"name": "conv2d_28/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.21930702013127945, "scale": 0.0014058142316107657, "original_dtype": "float32"}}, {"name": "conv2d_29/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.31052923483007094, "scale": 0.002250211846594717, "original_dtype": "float32"}}, {"name": "conv2d_29/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08809902153763116, "scale": 0.0007865984065859925, "original_dtype": "float32"}}, {"name": "conv2d_30/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.26004919094197887, "scale": 0.002063882467793483, "original_dtype": "float32"}}, {"name": "conv2d_30/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04724091595294429, "scale": 0.0006653650134217505, "original_dtype": "float32"}}, {"name": "conv2d_31/kernel", "shape": [3, 3, 128, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2876524791998022, "scale": 0.002282956184125414, "original_dtype": "float32"}}, {"name": "conv2d_31/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08468775509619245, "scale": 0.0007698886826926586, "original_dtype": "float32"}}, {"name": "conv2d_32/kernel", "shape": [7, 7, 32, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1589628664301891, "scale": 0.001111628436574749, "original_dtype": "float32"}}, {"name": "conv2d_32/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05865293674024881, "scale": 0.00042196357367085477, "original_dtype": "float32"}}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17419665385695066, "scale": 0.0015693392239364923, "original_dtype": "float32"}}, {"name": "conv2d_transpose_1/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08814702314489027, "scale": 0.0005509188946555642, "original_dtype": "float32"}}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.33368255285655746, "scale": 0.00222455035237705, "original_dtype": "float32"}}, {"name": "conv2d_transpose_2/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15110738075831356, "scale": 0.000825723392121932, "original_dtype": "float32"}}, {"name": "instance_normalization_13/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9453533887863159, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_13/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04254888743162155, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_14/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.854105532169342, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_14/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12727025151252747, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_15/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 1.2652510404586792, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_15/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0077461497858166695, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_16/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5391665101051331, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_16/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.4248017370700836, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_17/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.9359894394874573, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_17/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0838027149438858, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_18/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6327226758003235, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_18/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3658304810523987, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_19/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8751909732818604, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_19/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06947493553161621, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_20/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6444083452224731, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_20/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3346056044101715, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_21/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8074297904968262, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_21/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0749196708202362, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_22/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6523852944374084, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_22/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3265925943851471, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_23/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.876145601272583, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_23/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05584064498543739, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_24/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.5624637007713318, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_24/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.38424402475357056, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_25/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8932938575744629, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_25/beta", "shape": [1], "dtype": "float32", "quantization": 