{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"name": "conv2d_11/kernel", "shape": [4, 4, 3, 32], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [32], "dtype": "float32"}, {"name": "instance_normalization_7/gamma", "shape": [1], "dtype": "float32"}, {"name": "instance_normalization_7/beta", "shape": [1], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [4, 4, 32, 64], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [64], "dtype": "float32"}, {"name": "instance_normalization_8/gamma", "shape": [1], "dtype": "float32"}, {"name": "instance_normalization_8/beta", "shape": [1], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [4, 4, 64, 128], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [128], "dtype": "float32"}, {"name": "instance_normalization_9/gamma", "shape": [1], "dtype": "float32"}, {"name": "instance_normalization_9/beta", "shape": [1], "dtype": "float32"}, {"name": "conv2d_14/kernel", "shape": [4, 4, 128, 256], "dtype": "float32"}, {"name": "conv2d_14/bias", "shape": [256], "dtype": "float32"}, {"name": "instance_normalization_10/gamma", "shape": [1], "dtype": "float32"}, {"name": "instance_normalization_10/beta", "shape": [1], "dtype": "float32"}, {"name": "conv2d_15/kernel", "shape": [4, 4, 256, 128], "dtype": "float32"}, {"name": "conv2d_15/bias", "shape": [128], "dtype": "float32"}, {"name": "instance_normalization_11/gamma", "shape": [1], "dtype": "float32"}, {"name": "instance_normalization_11/beta", "shape": [1], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [4, 4, 256, 64], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [64], "dtype": "float32"}, {"name": "instance_normalization_12/gamma", "shape": [1], "dtype": "float32"}, {"name": "instance_normalization_12/beta", "shape": [1], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [4, 4, 128, 32], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [32], "dtype": "float32"}, {"name": "instance_normalization_13/gamma", "shape": [1], "dtype": "float32"}, {"name": "instance_normalization_13/beta", "shape": [1], "dtype": "float32"}, {"name": "conv2d_18/kernel", "shape": [4, 4, 64, 3], "dtype": "float32"}, {"name": "conv2d_18/bias", "shape": [3], "dtype": "float32"}]}]}