{"format": "layers-model", "generatedBy": "keras v2.3.1", "convertedBy": "TensorFlow.js Converter v3.0.0", "modelTopology": {"keras_version": "2.3.1", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 3], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "conv2d_37", "class_name": "Conv2D", "config": {"name": "conv2d_37", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_25", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_25", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_37", 0, 0, {}]]]}, {"name": "instance_normalization_7", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_7", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_25", 0, 0, {}]]]}, {"name": "conv2d_38", "class_name": "Conv2D", "config": {"name": "conv2d_38", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]]}, {"name": "leaky_re_lu_26", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_26", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_38", 0, 0, {}]]]}, {"name": "instance_normalization_8", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_8", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_26", 0, 0, {}]]]}, {"name": "conv2d_39", "class_name": "Conv2D", "config": {"name": "conv2d_39", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]]}, {"name": "leaky_re_lu_27", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_27", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_39", 0, 0, {}]]]}, {"name": "instance_normalization_9", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_9", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_27", 0, 0, {}]]]}, {"name": "conv2d_40", "class_name": "Conv2D", "config": {"name": "conv2d_40", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]]}, {"name": "leaky_re_lu_28", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_28", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "inbound_nodes": [[["conv2d_40", 0, 0, {}]]]}, {"name": "instance_normalization_10", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_10", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["leaky_re_lu_28", 0, 0, {}]]]}, {"name": "up_sampling2d_9", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_9", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_41", "class_name": "Conv2D", "config": {"name": "conv2d_41", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_9", 0, 0, {}]]]}, {"name": "instance_normalization_11", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_11", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_41", 0, 0, {}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["instance_normalization_11", 0, 0, {}], ["instance_normalization_9", 0, 0, {}]]]}, {"name": "up_sampling2d_10", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_10", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"name": "conv2d_42", "class_name": "Conv2D", "config": {"name": "conv2d_42", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_10", 0, 0, {}]]]}, {"name": "instance_normalization_12", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_12", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_42", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["instance_normalization_12", 0, 0, {}], ["instance_normalization_8", 0, 0, {}]]]}, {"name": "up_sampling2d_11", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_11", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "conv2d_43", "class_name": "Conv2D", "config": {"name": "conv2d_43", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_11", 0, 0, {}]]]}, {"name": "instance_normalization_13", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_13", "trainable": true, "dtype": "float32", "axis": null, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_43", 0, 0, {}]]]}, {"name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["instance_normalization_13", 0, 0, {}], ["instance_normalization_7", 0, 0, {}]]]}, {"name": "up_sampling2d_12", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_12", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "conv2d_44", "class_name": "Conv2D", "config": {"name": "conv2d_44", "trainable": true, "dtype": "float32", "filters": 3, "kernel_size": [4, 4], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_12", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["conv2d_44", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_37/kernel", "shape": [4, 4, 3, 32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.189997695590026, "scale": 5.027192030217124e-06, "original_dtype": "float32"}}, {"name": "conv2d_37/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.031801659353046144, "scale": 1.1277584082076011e-06, "original_dtype": "float32"}}, {"name": "conv2d_38/kernel", "shape": [4, 4, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.10527764935931215, "scale": 3.018540853838121e-06, "original_dtype": "float32"}}, {"name": "conv2d_38/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.013181345624958768, "scale": 3.6136046344158696e-07, "original_dtype": "float32"}}, {"name": "conv2d_39/kernel", "shape": [4, 4, 64, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.0886016335774634, "scale": 2.749810172789901e-06, "original_dtype": "float32"}}, {"name": "conv2d_39/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.012887415389242656, "scale": 3.3037877843628633e-07, "original_dtype": "float32"}}, {"name": "conv2d_40/kernel", "shape": [4, 4, 128, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.09709395845146741, "scale": 2.8839504099405177e-06, "original_dtype": "float32"}}, {"name": "conv2d_40/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.017588928498414702, "scale": 4.263775937752037e-07, "original_dtype": "float32"}}, {"name": "conv2d_41/kernel", "shape": [4, 4, 256, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.09074624585252228, "scale": 3.3191750494704564e-06, "original_dtype": "float32"}}, {"name": "conv2d_41/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.020947799681304082, "scale": 4.0987320343789785e-07, "original_dtype": "float32"}}, {"name": "conv2d_42/kernel", "shape": [4, 4, 256, 64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.11288948221531633, "scale": 3.2924864297056124e-06, "original_dtype": "float32"}}, {"name": "conv2d_42/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.015403117611165827, "scale": 4.708849503581617e-07, "original_dtype": "float32"}}, {"name": "conv2d_43/kernel", "shape": [4, 4, 128, 32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.10711238447139344, "scale": 3.555007781991153e-06, "original_dtype": "float32"}}, {"name": "conv2d_43/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.00936429555178771, "scale": 4.266777031843855e-07, "original_dtype": "float32"}}, {"name": "conv2d_44/kernel", "shape": [4, 4, 64, 3], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.08652357845291117, "scale": 2.742601066720907e-06, "original_dtype": "float32"}}, {"name": "conv2d_44/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.0028405929915606976, "scale": 4.221427228727812e-08, "original_dtype": "float32"}}, {"name": "instance_normalization_10/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0409166812896729, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_10/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.004088175483047962, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_11/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.088781714439392, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_11/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.0018723893444985151, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_12/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 1.0389858484268188, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_12/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.0030418827664107084, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_13/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.8932703733444214, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_13/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.05564459413290024, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_7/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.8977686762809753, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_7/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.016798628494143486, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_8/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.9600737690925598, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_8/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.0009966774377971888, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_9/gamma", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.9080016016960144, "scale": 1.0, "original_dtype": "float32"}}, {"name": "instance_normalization_9/beta", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.006187779363244772, "scale": 1.0, "original_dtype": "float32"}}]}]}