{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v3.1.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_8", "layers": [{"name": "input_9", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_9"}, "inbound_nodes": []}, {"name": "reflection_padding2d_41", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_41", "trainable": true}, "inbound_nodes": [[["input_9", 0, 0, {}]]]}, {"name": "conv2d_65", "class_name": "Conv2D", "config": {"name": "conv2d_65", "trainable": true, "filters": 16, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_41", 0, 0, {}]]]}, {"name": "instance_normalization_59", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_59", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_65", 0, 0, {}]]]}, {"name": "activation_31", "class_name": "Activation", "config": {"name": "activation_31", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_59", 0, 0, {}]]]}, {"name": "conv2d_66", "class_name": "Conv2D", "config": {"name": "conv2d_66", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_31", 0, 0, {}]]]}, {"name": "instance_normalization_60", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_60", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_66", 0, 0, {}]]]}, {"name": "activation_32", "class_name": "Activation", "config": {"name": "activation_32", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_60", 0, 0, {}]]]}, {"name": "conv2d_67", "class_name": "Conv2D", "config": {"name": "conv2d_67", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_32", 0, 0, {}]]]}, {"name": "instance_normalization_61", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_61", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_67", 0, 0, {}]]]}, {"name": "activation_33", "class_name": "Activation", "config": {"name": "activation_33", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_61", 0, 0, {}]]]}, {"name": "reflection_padding2d_42", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_42", "trainable": true}, "inbound_nodes": [[["activation_33", 0, 0, {}]]]}, {"name": "conv2d_68", "class_name": "Conv2D", "config": {"name": "conv2d_68", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_42", 0, 0, {}]]]}, {"name": "instance_normalization_62", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_62", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_68", 0, 0, {}]]]}, {"name": "activation_34", "class_name": "Activation", "config": {"name": "activation_34", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_62", 0, 0, {}]]]}, {"name": "reflection_padding2d_43", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_43", "trainable": true}, "inbound_nodes": [[["activation_34", 0, 0, {}]]]}, {"name": "conv2d_69", "class_name": "Conv2D", "config": {"name": "conv2d_69", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_43", 0, 0, {}]]]}, {"name": "instance_normalization_63", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_63", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_69", 0, 0, {}]]]}, {"name": "add_19", "class_name": "Add", "config": {"name": "add_19", "trainable": true}, "inbound_nodes": [[["activation_33", 0, 0, {}], ["instance_normalization_63", 0, 0, {}]]]}, {"name": "reflection_padding2d_44", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_44", "trainable": true}, "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"name": "conv2d_70", "class_name": "Conv2D", "config": {"name": "conv2d_70", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_44", 0, 0, {}]]]}, {"name": "instance_normalization_64", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_64", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_70", 0, 0, {}]]]}, {"name": "activation_35", "class_name": "Activation", "config": {"name": "activation_35", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_64", 0, 0, {}]]]}, {"name": "reflection_padding2d_45", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_45", "trainable": true}, "inbound_nodes": [[["activation_35", 0, 0, {}]]]}, {"name": "conv2d_71", "class_name": "Conv2D", "config": {"name": "conv2d_71", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_45", 0, 0, {}]]]}, {"name": "instance_normalization_65", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_65", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_71", 0, 0, {}]]]}, {"name": "add_20", "class_name": "Add", "config": {"name": "add_20", "trainable": true}, "inbound_nodes": [[["add_19", 0, 0, {}], ["instance_normalization_65", 0, 0, {}]]]}, {"name": "reflection_padding2d_46", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_46", "trainable": true}, "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"name": "conv2d_72", "class_name": "Conv2D", "config": {"name": "conv2d_72", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_46", 0, 0, {}]]]}, {"name": "instance_normalization_66", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_66", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_72", 0, 0, {}]]]}, {"name": "activation_36", "class_name": "Activation", "config": {"name": "activation_36", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_66", 0, 0, {}]]]}, {"name": "reflection_padding2d_47", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_47", "trainable": true}, "inbound_nodes": [[["activation_36", 0, 0, {}]]]}, {"name": "conv2d_73", "class_name": "Conv2D", "config": {"name": "conv2d_73", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_47", 0, 0, {}]]]}, {"name": "instance_normalization_67", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_67", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_73", 0, 0, {}]]]}, {"name": "add_21", "class_name": "Add", "config": {"name": "add_21", "trainable": true}, "inbound_nodes": [[["add_20", 0, 0, {}], ["instance_normalization_67", 0, 0, {}]]]}, {"name": "reflection_padding2d_48", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_48", "trainable": true}, "inbound_nodes": [[["add_21", 0, 0, {}]]]}, {"name": "conv2d_74", "class_name": "Conv2D", "config": {"name": "conv2d_74", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_48", 0, 0, {}]]]}, {"name": "instance_normalization_68", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_68", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_74", 0, 0, {}]]]}, {"name": "activation_37", "class_name": "Activation", "config": {"name": "activation_37", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_68", 0, 0, {}]]]}, {"name": "reflection_padding2d_49", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_49", "trainable": true}, "inbound_nodes": [[["activation_37", 0, 0, {}]]]}, {"name": "conv2d_75", "class_name": "Conv2D", "config": {"name": "conv2d_75", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_49", 0, 0, {}]]]}, {"name": "instance_normalization_69", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_69", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_75", 0, 0, {}]]]}, {"name": "add_22", "class_name": "Add", "config": {"name": "add_22", "trainable": true}, "inbound_nodes": [[["add_21", 0, 0, {}], ["instance_normalization_69", 0, 0, {}]]]}, {"name": "reflection_padding2d_50", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_50", "trainable": true}, "inbound_nodes": [[["add_22", 0, 0, {}]]]}, {"name": "conv2d_76", "class_name": "Conv2D", "config": {"name": "conv2d_76", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_50", 0, 0, {}]]]}, {"name": "instance_normalization_70", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_70", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_76", 0, 0, {}]]]}, {"name": "activation_38", "class_name": "Activation", "config": {"name": "activation_38", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_70", 0, 0, {}]]]}, {"name": "reflection_padding2d_51", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_51", "trainable": true}, "inbound_nodes": [[["activation_38", 0, 0, {}]]]}, {"name": "conv2d_77", "class_name": "Conv2D", "config": {"name": "conv2d_77", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_51", 0, 0, {}]]]}, {"name": "instance_normalization_71", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_71", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_77", 0, 0, {}]]]}, {"name": "add_23", "class_name": "Add", "config": {"name": "add_23", "trainable": true}, "inbound_nodes": [[["add_22", 0, 0, {}], ["instance_normalization_71", 0, 0, {}]]]}, {"name": "reflection_padding2d_52", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_52", "trainable": true}, "inbound_nodes": [[["add_23", 0, 0, {}]]]}, {"name": "conv2d_78", "class_name": "Conv2D", "config": {"name": "conv2d_78", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_52", 0, 0, {}]]]}, {"name": "instance_normalization_72", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_72", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_78", 0, 0, {}]]]}, {"name": "activation_39", "class_name": "Activation", "config": {"name": "activation_39", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_72", 0, 0, {}]]]}, {"name": "reflection_padding2d_53", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_53", "trainable": true}, "inbound_nodes": [[["activation_39", 0, 0, {}]]]}, {"name": "conv2d_79", "class_name": "Conv2D", "config": {"name": "conv2d_79", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_53", 0, 0, {}]]]}, {"name": "instance_normalization_73", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_73", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_79", 0, 0, {}]]]}, {"name": "add_24", "class_name": "Add", "config": {"name": "add_24", "trainable": true}, "inbound_nodes": [[["add_23", 0, 0, {}], ["instance_normalization_73", 0, 0, {}]]]}, {"name": "reflection_padding2d_54", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_54", "trainable": true}, "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"name": "conv2d_80", "class_name": "Conv2D", "config": {"name": "conv2d_80", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_54", 0, 0, {}]]]}, {"name": "instance_normalization_74", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_74", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_80", 0, 0, {}]]]}, {"name": "activation_40", "class_name": "Activation", "config": {"name": "activation_40", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_74", 0, 0, {}]]]}, {"name": "reflection_padding2d_55", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_55", "trainable": true}, "inbound_nodes": [[["activation_40", 0, 0, {}]]]}, {"name": "conv2d_81", "class_name": "Conv2D", "config": {"name": "conv2d_81", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_55", 0, 0, {}]]]}, {"name": "instance_normalization_75", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_75", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_81", 0, 0, {}]]]}, {"name": "add_25", "class_name": "Add", "config": {"name": "add_25", "trainable": true}, "inbound_nodes": [[["add_24", 0, 0, {}], ["instance_normalization_75", 0, 0, {}]]]}, {"name": "reflection_padding2d_56", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_56", "trainable": true}, "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"name": "conv2d_82", "class_name": "Conv2D", "config": {"name": "conv2d_82", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_56", 0, 0, {}]]]}, {"name": "instance_normalization_76", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_76", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_82", 0, 0, {}]]]}, {"name": "activation_41", "class_name": "Activation", "config": {"name": "activation_41", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_76", 0, 0, {}]]]}, {"name": "reflection_padding2d_57", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_57", "trainable": true}, "inbound_nodes": [[["activation_41", 0, 0, {}]]]}, {"name": "conv2d_83", "class_name": "Conv2D", "config": {"name": "conv2d_83", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_57", 0, 0, {}]]]}, {"name": "instance_normalization_77", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_77", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_83", 0, 0, {}]]]}, {"name": "add_26", "class_name": "Add", "config": {"name": "add_26", "trainable": true}, "inbound_nodes": [[["add_25", 0, 0, {}], ["instance_normalization_77", 0, 0, {}]]]}, {"name": "reflection_padding2d_58", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_58", "trainable": true}, "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"name": "conv2d_84", "class_name": "Conv2D", "config": {"name": "conv2d_84", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_58", 0, 0, {}]]]}, {"name": "instance_normalization_78", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_78", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_84", 0, 0, {}]]]}, {"name": "activation_42", "class_name": "Activation", "config": {"name": "activation_42", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_78", 0, 0, {}]]]}, {"name": "reflection_padding2d_59", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_59", "trainable": true}, "inbound_nodes": [[["activation_42", 0, 0, {}]]]}, {"name": "conv2d_85", "class_name": "Conv2D", "config": {"name": "conv2d_85", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_59", 0, 0, {}]]]}, {"name": "instance_normalization_79", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_79", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_85", 0, 0, {}]]]}, {"name": "add_27", "class_name": "Add", "config": {"name": "add_27", "trainable": true}, "inbound_nodes": [[["add_26", 0, 0, {}], ["instance_normalization_79", 0, 0, {}]]]}, {"name": "conv2d_transpose_5", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_5", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_27", 0, 0, {}]]]}, {"name": "instance_normalization_80", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_80", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_5", 0, 0, {}]]]}, {"name": "activation_43", "class_name": "Activation", "config": {"name": "activation_43", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_80", 0, 0, {}]]]}, {"name": "conv2d_transpose_6", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_6", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_43", 0, 0, {}]]]}, {"name": "instance_normalization_81", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_81", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_6", 0, 0, {}]]]}, {"name": "activation_44", "class_name": "Activation", "config": {"name": "activation_44", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_81", 0, 0, {}]]]}, {"name": "reflection_padding2d_60", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_60", "trainable": true}, "inbound_nodes": [[["activation_44", 0, 0, {}]]]}, {"name": "conv2d_86", "class_name": "Conv2D", "config": {"name": "conv2d_86", "trainable": true, "filters": 3, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reflection_padding2d_60", 0, 0, {}]]]}, {"name": "activation_45", "class_name": "Activation", "config": {"name": "activation_45", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["conv2d_86", 0, 0, {}]]]}], "input_layers": [["input_9", 0, 0]], "output_layers": [["activation_45", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_65/kernel", "shape": [7, 7, 3, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13594025560453826, "scale": 0.0019146514873878628, "original_dtype": "float32"}}, {"name": "conv2d_65/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.05522662707987954, "scale": 0.00030681459488821967, "original_dtype": "float32"}}, {"name": "conv2d_66/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.253334961568608, "scale": 0.0018357605910768696, "original_dtype": "float32"}}, {"name": "conv2d_66/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.026158912333787657, "scale": 0.0001767494076607274, "original_dtype": "float32"}}, {"name": "conv2d_67/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.3364026336108937, "scale": 0.0024377002435572006, "original_dtype": "float32"}}, {"name": "conv2d_67/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.011108660975507662, "scale": 7.030798085764343e-05, "original_dtype": "float32"}}, {"name": "conv2d_68/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2103758127081628, "scale": 0.0019846774783788945, "original_dtype": "float32"}}, {"name": "conv2d_68/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.010707917619569629, "scale": 6.529218060713188e-05, "original_dtype": "float32"}}, {"name": "conv2d_69/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2450531054945553, "scale": 0.0018564629204132978, "original_dtype": "float32"}}, {"name": "conv2d_69/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.007831547000244552, "scale": 5.634206474996081e-05, "original_dtype": "float32"}}, {"name": "conv2d_70/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20234418558139428, "scale": 0.001908907411145229, "original_dtype": "float32"}}, {"name": "conv2d_70/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.001994442842973798, "scale": 1.7342981243250418e-05, "original_dtype": "float32"}}, {"name": "conv2d_71/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.20108269336176854, "scale": 0.0015709585418888167, "original_dtype": "float32"}}, {"name": "conv2d_71/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.006865247660407833, "scale": 6.476648736233805e-05, "original_dtype": "float32"}}, {"name": "conv2d_72/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.25439407357982563, "scale": 0.002051565109514723, "original_dtype": "float32"}}, {"name": "conv2d_72/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0011422988013638292, "scale": 9.763237618494267e-06, "original_dtype": "float32"}}, {"name": "conv2d_73/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.24915509784922882, "scale": 0.0017423433416029986, "original_dtype": "float32"}}, {"name": "conv2d_73/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.003953771150725729, "scale": 2.455758478711633e-05, "original_dtype": "float32"}}, {"name": "conv2d_74/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2314502239227295, "scale": 0.0019449598648968865, "original_dtype": "float32"}}, {"name": "conv2d_74/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0017776880194159115, "scale": 9.258791767791206e-06, "original_dtype": "float32"}}, {"name": "conv2d_75/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.19992354827768663, "scale": 0.0018511439655341355, "original_dtype": "float32"}}, {"name": "conv2d_75/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.001917757641743211, "scale": 3.9953284202983564e-05, "original_dtype": "float32"}}, {"name": "conv2d_76/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.25737092348874785, "scale": 0.0017997966677534814, "original_dtype": "float32"}}, {"name": "conv2d_76/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0010305966962786282, "scale": 1.0735382252902377e-05, "original_dtype": "float32"}}, {"name": "conv2d_77/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2415878078516792, "scale": 0.0019802279332104852, "original_dtype": "float32"}}, {"name": "conv2d_77/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0011409993703458824, "scale": 1.426249212932353e-05, "original_dtype": "float32"}}, {"name": "conv2d_78/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2997893813778373, "scale": 0.0020675129750195673, "original_dtype": "float32"}}, {"name": "conv2d_78/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0005406723955792247, "scale": 6.514125247942466e-06, "original_dtype": "float32"}}, {"name": "conv2d_79/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22213241282631369, "scale": 0.0017913904260186588, "original_dtype": "float32"}}, {"name": "conv2d_79/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.002672473977630337, "scale": 2.3238904153307278e-05, "original_dtype": "float32"}}, {"name": "conv2d_80/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2332670489947001, "scale": 0.0019602273024764715, "original_dtype": "float32"}}, {"name": "conv2d_80/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00044000352728271896, "scale": 3.3846425175593765e-06, "original_dtype": "float32"}}, {"name": "conv2d_81/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2065648408497081, "scale": 0.0016931544331943288, "original_dtype": "float32"}}, {"name": "conv2d_81/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.001456100625150344, "scale": 1.0551453805437275e-05, "original_dtype": "float32"}}, {"name": "conv2d_82/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.25975994678104625, "scale": 0.001842269126106711, "original_dtype": "float32"}}, {"name": "conv2d_82/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0020220477234426082, "scale": 9.537960959634944e-06, "original_dtype": "float32"}}, {"name": "conv2d_83/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2154720225754906, "scale": 0.0017100954172657985, "original_dtype": "float32"}}, {"name": "conv2d_83/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0011495970116526472, "scale": 1.306360240514372e-05, "original_dtype": "float32"}}, {"name": "conv2d_84/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2865683746104147, "scale": 0.001923277681949092, "original_dtype": "float32"}}, {"name": "conv2d_84/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0006489066564587547, "scale": 4.326044376391698e-06, "original_dtype": "float32"}}, {"name": "conv2d_85/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.23874554914586685, "scale": 0.0018086784026202034, "original_dtype": "float32"}}, {"name": "conv2d_85/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0008657158790704082, "scale": 1.202383165375567e-05, "original_dtype": "float32"}}, {"name": "conv2d_86/kernel", "shape": [7, 7, 16, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09547889407943277, "scale": 0.000884063834068822, "original_dtype": "float32"}}, {"name": "conv2d_86/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.06342579424381256, "scale": 0.0003730929073165445, "original_dtype": "float32"}}, {"name": "conv2d_transpose_5/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22684335556684757, "scale": 0.001922401318363115, "original_dtype": "float32"}}, {"name": "conv2d_transpose_5/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.006178605794797049, "scale": 3.88591559421198e-05, "original_dtype": "float32"}}, {"name": "conv2d_transpose_6/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.47088884115219115, "scale": 0.0024272620677947996, "original_dtype": "float32"}}, {"name": "conv2d_transpose_6/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.04454165534938083, "scale": 0.0003400126362548155, "original_dtype": "float32"}}]}]}