{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v3.1.0", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "zero_padding2d_1", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_1", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"name": "conv2d_11", "trainable": true, "filters": 16, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]}, {"name": "instance_normalization_7", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_7", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"name": "conv2d_12", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "instance_normalization_8", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_8", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_8", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"name": "conv2d_13", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "instance_normalization_9", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_9", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_9", 0, 0, {}]]]}, {"name": "zero_padding2d_2", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_2", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"name": "conv2d_14", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]]}, {"name": "instance_normalization_10", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_10", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_10", 0, 0, {}]]]}, {"name": "zero_padding2d_3", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_3", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"name": "conv2d_15", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_3", 0, 0, {}]]]}, {"name": "instance_normalization_11", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_11", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["instance_normalization_11", 0, 0, {}]]]}, {"name": "zero_padding2d_4", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_4", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"name": "conv2d_16", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_4", 0, 0, {}]]]}, {"name": "instance_normalization_12", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_12", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_12", 0, 0, {}]]]}, {"name": "zero_padding2d_5", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_5", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"name": "conv2d_17", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"name": "instance_normalization_13", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_13", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["add_1", 0, 0, {}], ["instance_normalization_13", 0, 0, {}]]]}, {"name": "zero_padding2d_6", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_6", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"name": "conv2d_18", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"name": "instance_normalization_14", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_14", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_14", 0, 0, {}]]]}, {"name": "zero_padding2d_7", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_7", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"name": "conv2d_19", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_7", 0, 0, {}]]]}, {"name": "instance_normalization_15", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_15", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["add_2", 0, 0, {}], ["instance_normalization_15", 0, 0, {}]]]}, {"name": "zero_padding2d_8", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_8", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"name": "conv2d_20", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_8", 0, 0, {}]]]}, {"name": "instance_normalization_16", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_16", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_16", 0, 0, {}]]]}, {"name": "zero_padding2d_9", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_9", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"name": "conv2d_21", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_9", 0, 0, {}]]]}, {"name": "instance_normalization_17", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_17", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["add_3", 0, 0, {}], ["instance_normalization_17", 0, 0, {}]]]}, {"name": "zero_padding2d_10", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_10", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"name": "conv2d_22", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_10", 0, 0, {}]]]}, {"name": "instance_normalization_18", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_18", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_18", 0, 0, {}]]]}, {"name": "zero_padding2d_11", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_11", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"name": "conv2d_23", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_11", 0, 0, {}]]]}, {"name": "instance_normalization_19", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_19", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["add_4", 0, 0, {}], ["instance_normalization_19", 0, 0, {}]]]}, {"name": "zero_padding2d_12", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_12", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"name": "conv2d_24", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_12", 0, 0, {}]]]}, {"name": "instance_normalization_20", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_20", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_20", 0, 0, {}]]]}, {"name": "zero_padding2d_13", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_13", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"name": "conv2d_25", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_13", 0, 0, {}]]]}, {"name": "instance_normalization_21", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_21", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "add_6", "class_name": "Add", "config": {"name": "add_6", "trainable": true}, "inbound_nodes": [[["add_5", 0, 0, {}], ["instance_normalization_21", 0, 0, {}]]]}, {"name": "zero_padding2d_14", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_14", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_6", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"name": "conv2d_26", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_14", 0, 0, {}]]]}, {"name": "instance_normalization_22", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_22", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_22", 0, 0, {}]]]}, {"name": "zero_padding2d_15", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_15", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"name": "conv2d_27", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_15", 0, 0, {}]]]}, {"name": "instance_normalization_23", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_23", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "add_7", "class_name": "Add", "config": {"name": "add_7", "trainable": true}, "inbound_nodes": [[["add_6", 0, 0, {}], ["instance_normalization_23", 0, 0, {}]]]}, {"name": "zero_padding2d_16", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_16", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_7", 0, 0, {}]]]}, {"name": "conv2d_28", "class_name": "Conv2D", "config": {"name": "conv2d_28", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_16", 0, 0, {}]]]}, {"name": "instance_normalization_24", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_24", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_24", 0, 0, {}]]]}, {"name": "zero_padding2d_17", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_17", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "conv2d_29", "class_name": "Conv2D", "config": {"name": "conv2d_29", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_17", 0, 0, {}]]]}, {"name": "instance_normalization_25", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_25", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]]}, {"name": "add_8", "class_name": "Add", "config": {"name": "add_8", "trainable": true}, "inbound_nodes": [[["add_7", 0, 0, {}], ["instance_normalization_25", 0, 0, {}]]]}, {"name": "zero_padding2d_18", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_18", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["add_8", 0, 0, {}]]]}, {"name": "conv2d_30", "class_name": "Conv2D", "config": {"name": "conv2d_30", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_18", 0, 0, {}]]]}, {"name": "instance_normalization_26", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_26", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_26", 0, 0, {}]]]}, {"name": "zero_padding2d_19", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_19", "trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "conv2d_31", "class_name": "Conv2D", "config": {"name": "conv2d_31", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_19", 0, 0, {}]]]}, {"name": "instance_normalization_27", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_27", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_31", 0, 0, {}]]]}, {"name": "add_9", "class_name": "Add", "config": {"name": "add_9", "trainable": true}, "inbound_nodes": [[["add_8", 0, 0, {}], ["instance_normalization_27", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_1", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["add_9", 0, 0, {}]]]}, {"name": "instance_normalization_28", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_28", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_28", 0, 0, {}]]]}, {"name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_2", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "instance_normalization_29", "class_name": "InstanceNormalization", "config": {"name": "instance_normalization_29", "trainable": true, "axis": -1, "epsilon": 0.001, "center": false, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["instance_normalization_29", 0, 0, {}]]]}, {"name": "zero_padding2d_20", "class_name": "ZeroPadding2D", "config": {"name": "zero_padding2d_20", "trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "conv2d_32", "class_name": "Conv2D", "config": {"name": "conv2d_32", "trainable": true, "filters": 3, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "RandomNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["zero_padding2d_20", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["conv2d_32", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["activation_15", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_11/kernel", "shape": [7, 7, 3, 16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11801070763784297, "scale": 0.0010728246148894816, "original_dtype": "float32"}}, {"name": "conv2d_11/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.011593055199174319, "scale": 9.660879332645266e-05, "original_dtype": "float32"}}, {"name": "conv2d_12/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1258770201136084, "scale": 0.0009757908535938637, "original_dtype": "float32"}}, {"name": "conv2d_12/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.004859948165568651, "scale": 4.8599481655686506e-05, "original_dtype": "float32"}}, {"name": "conv2d_13/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.11238756927789426, "scale": 0.0010034604399811987, "original_dtype": "float32"}}, {"name": "conv2d_13/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.006031143897231302, "scale": 3.5687241995451495e-05, "original_dtype": "float32"}}, {"name": "conv2d_14/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15226800021003276, "scale": 0.0010574166681252275, "original_dtype": "float32"}}, {"name": "conv2d_14/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0016818860048135999, "scale": 1.889759555970337e-05, "original_dtype": "float32"}}, {"name": "conv2d_15/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.17540170994459414, "scale": 0.0012618828053567923, "original_dtype": "float32"}}, {"name": "conv2d_15/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.001673801955949588, "scale": 1.5355981247243928e-05, "original_dtype": "float32"}}, {"name": "conv2d_16/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13808040724081153, "scale": 0.001180174420861637, "original_dtype": "float32"}}, {"name": "conv2d_16/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00059413312769988, "scale": 3.7133320481242503e-06, "original_dtype": "float32"}}, {"name": "conv2d_17/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1822048158037896, "scale": 0.0012228511127771115, "original_dtype": "float32"}}, {"name": "conv2d_17/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0013680948674970983, "scale": 9.567096975504184e-06, "original_dtype": "float32"}}, {"name": "conv2d_18/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14911330447477453, "scale": 0.0010650950319626752, "original_dtype": "float32"}}, {"name": "conv2d_18/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0002204999167873871, "scale": 1.541957460051658e-06, "original_dtype": "float32"}}, {"name": "conv2d_19/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15169763798807182, "scale": 0.0011669049076005525, "original_dtype": "float32"}}, {"name": "conv2d_19/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.001127296780674335, "scale": 8.168817251263296e-06, "original_dtype": "float32"}}, {"name": "conv2d_20/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12913575382793652, "scale": 0.0010584897854748895, "original_dtype": "float32"}}, {"name": "conv2d_20/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00035841478966176506, "scale": 3.0118889887543284e-06, "original_dtype": "float32"}}, {"name": "conv2d_21/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13452318228927312, "scale": 0.0010509623616349463, "original_dtype": "float32"}}, {"name": "conv2d_21/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.000774047348429175, "scale": 8.062993212803905e-06, "original_dtype": "float32"}}, {"name": "conv2d_22/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13331476525933136, "scale": 0.0012230712409112968, "original_dtype": "float32"}}, {"name": "conv2d_22/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00014710618775365327, "scale": 1.5817869650930458e-06, "original_dtype": "float32"}}, {"name": "conv2d_23/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13152673571717505, "scale": 0.0010606994815901213, "original_dtype": "float32"}}, {"name": "conv2d_23/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0007309211938477613, "scale": 5.53728177157395e-06, "original_dtype": "float32"}}, {"name": "conv2d_24/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1581598008964576, "scale": 0.001154451101433997, "original_dtype": "float32"}}, {"name": "conv2d_24/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00047293175080352845, "scale": 2.8319266515181345e-06, "original_dtype": "float32"}}, {"name": "conv2d_25/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12863380797937804, "scale": 0.0011801266787098902, "original_dtype": "float32"}}, {"name": "conv2d_25/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0006395068553769413, "scale": 6.090541479780393e-06, "original_dtype": "float32"}}, {"name": "conv2d_26/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13644262575635724, "scale": 0.001065958013721541, "original_dtype": "float32"}}, {"name": "conv2d_26/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00035229015481366097, "scale": 2.818321238509288e-06, "original_dtype": "float32"}}, {"name": "conv2d_27/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.15672471593408024, "scale": 0.0011873084540460624, "original_dtype": "float32"}}, {"name": "conv2d_27/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0011259142154206832, "scale": 8.465520416696866e-06, "original_dtype": "float32"}}, {"name": "conv2d_28/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14388941719251522, "scale": 0.0010818753172369565, "original_dtype": "float32"}}, {"name": "conv2d_28/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.00031185717186114437, "scale": 2.1507391162837544e-06, "original_dtype": "float32"}}, {"name": "conv2d_29/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.12665809276057224, "scale": 0.0011308758282193951, "original_dtype": "float32"}}, {"name": "conv2d_29/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0006336912690826199, "scale": 5.558695342829999e-06, "original_dtype": "float32"}}, {"name": "conv2d_30/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1300298084230984, "scale": 0.001074626515893375, "original_dtype": "float32"}}, {"name": "conv2d_30/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0002365826912151248, "scale": 1.68987636582232e-06, "original_dtype": "float32"}}, {"name": "conv2d_31/kernel", "shape": [3, 3, 64, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.14390359018363205, "scale": 0.0011242467983096254, "original_dtype": "float32"}}, {"name": "conv2d_31/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0011469570043332437, "scale": 7.3054586263263925e-06, "original_dtype": "float32"}}, {"name": "conv2d_32/kernel", "shape": [7, 7, 16, 3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09749977202976451, "scale": 0.0007386346365891251, "original_dtype": "float32"}}, {"name": "conv2d_32/bias", "shape": [3], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.035679547634779235, "scale": 0.00021364998583700142, "original_dtype": "float32"}}, {"name": "conv2d_transpose_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.1299745758374532, "scale": 0.001092223326365153, "original_dtype": "float32"}}, {"name": "conv2d_transpose_1/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.0017823502786603628, "scale": 1.7137983448657334e-05, "original_dtype": "float32"}}, {"name": "conv2d_transpose_2/kernel", "shape": [3, 3, 16, 32], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.2697601833472065, "scale": 0.0014123569808754267, "original_dtype": "float32"}}, {"name": "conv2d_transpose_2/bias", "shape": [16], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.029870427356046787, "scale": 0.00015557514247941035, "original_dtype": "float32"}}]}]}